{
  "nodes": [
    {
      "op": "null", 
      "name": "q_data", 
      "attrs": {"__shape__": "(350, 10)"}, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "q_embed_weight", 
      "attrs": {
        "input_dim": "5", 
        "output_dim": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "q_embed", 
      "attrs": {
        "input_dim": "5", 
        "output_dim": "50"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attrs": {
        "axis": "0", 
        "num_outputs": "350", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "init_memory_key_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation0", 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "init_memory_value", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.1}]", 
        "__shape__": "(50, 100)"
      }, 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to0", 
      "attrs": {"shape": "(10, 50, 100)"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot0", 
      "inputs": [[8, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 1, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation1", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "qa_data", 
      "attrs": {"__shape__": "(350, 10)"}, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "qa_embed_weight", 
      "attrs": {
        "input_dim": "9", 
        "output_dim": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "qa_embed", 
      "attrs": {
        "input_dim": "9", 
        "output_dim": "100"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel1", 
      "attrs": {
        "axis": "0", 
        "num_outputs": "350", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DKVMN->value_head:erase_signal_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DKVMN->value_head:erase_signal_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot1", 
      "inputs": [[17, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[11, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DKVMN->value_head:add_signal_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DKVMN->value_head:add_signal_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot2", 
      "inputs": [[31, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[30, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot3", 
      "inputs": [[16, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 2, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation2", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape12", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 1, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot4", 
      "inputs": [[44, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[38, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape10", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 1, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot5", 
      "inputs": [[51, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[50, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot6", 
      "inputs": [[43, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 3, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation3", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape18", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape14", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 2, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape15", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot7", 
      "inputs": [[62, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar2", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[56, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape16", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 2, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape17", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot8", 
      "inputs": [[69, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[68, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot9", 
      "inputs": [[61, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape19", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 4, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation4", 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape24", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape20", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 3, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot10", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar3", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[74, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape22", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected7", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 3, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape23", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot11", 
      "inputs": [[87, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[86, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot12", 
      "inputs": [[79, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape25", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 5, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation5", 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape30", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape26", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected8", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 4, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape27", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot13", 
      "inputs": [[98, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar4", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[92, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape28", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected9", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 4, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape29", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot14", 
      "inputs": [[105, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[104, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot15", 
      "inputs": [[97, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape31", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 6, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation6", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape36", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape32", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected10", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 5, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape33", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot16", 
      "inputs": [[116, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar5", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[110, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape34", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected11", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 5, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape35", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot17", 
      "inputs": [[123, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[122, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot18", 
      "inputs": [[115, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape37", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 7, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation7", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape42", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape38", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected12", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 6, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape39", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot19", 
      "inputs": [[134, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar6", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[128, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape40", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected13", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 6, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape41", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot20", 
      "inputs": [[141, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[140, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot21", 
      "inputs": [[133, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape43", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 8, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation8", 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape48", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape44", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected14", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 7, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape45", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot22", 
      "inputs": [[152, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar7", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[146, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape46", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected15", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 7, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape47", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot23", 
      "inputs": [[159, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[158, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot24", 
      "inputs": [[151, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape49", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 9, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation9", 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape54", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape50", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected16", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 8, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape51", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot25", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar8", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[164, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape52", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected17", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 8, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape53", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot26", 
      "inputs": [[177, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[176, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot27", 
      "inputs": [[169, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape55", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 10, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation10", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape60", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape56", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected18", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 9, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape57", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot28", 
      "inputs": [[188, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar9", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[182, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape58", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected19", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 9, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape59", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot29", 
      "inputs": [[195, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[194, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot30", 
      "inputs": [[187, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape61", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 11, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation11", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape66", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape62", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected20", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 10, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape63", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot31", 
      "inputs": [[206, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar10", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[200, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape64", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected21", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 10, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape65", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot32", 
      "inputs": [[213, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[212, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot33", 
      "inputs": [[205, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape67", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 12, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation12", 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape72", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape68", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected22", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 11, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape69", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot34", 
      "inputs": [[224, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar11", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[218, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape70", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected23", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 11, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape71", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot35", 
      "inputs": [[231, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[230, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot36", 
      "inputs": [[223, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape73", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 13, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation13", 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape78", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape74", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected24", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 12, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape75", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot37", 
      "inputs": [[242, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar12", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul12", 
      "inputs": [[236, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape76", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected25", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 12, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape77", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot38", 
      "inputs": [[249, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[248, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot39", 
      "inputs": [[241, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape79", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 14, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation14", 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape84", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape80", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected26", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 13, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape81", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot40", 
      "inputs": [[260, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar13", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul13", 
      "inputs": [[254, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape82", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected27", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 13, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape83", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot41", 
      "inputs": [[267, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[266, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot42", 
      "inputs": [[259, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape85", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 15, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation15", 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape90", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape86", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected28", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 14, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape87", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot43", 
      "inputs": [[278, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar14", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul14", 
      "inputs": [[272, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape88", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected29", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 14, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape89", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot44", 
      "inputs": [[285, 0, 0], [288, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[284, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot45", 
      "inputs": [[277, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape91", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 16, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation16", 
      "inputs": [[293, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape96", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape92", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected30", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 15, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape93", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot46", 
      "inputs": [[296, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar15", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul15", 
      "inputs": [[290, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape94", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected31", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 15, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape95", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot47", 
      "inputs": [[303, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[302, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot48", 
      "inputs": [[295, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape97", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 17, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation17", 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape102", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape98", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected32", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 16, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape99", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot49", 
      "inputs": [[314, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar16", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul16", 
      "inputs": [[308, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape100", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected33", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 16, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape101", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot50", 
      "inputs": [[321, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[320, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot51", 
      "inputs": [[313, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape103", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 18, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation18", 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape108", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape104", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected34", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 17, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[333, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape105", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[334, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot52", 
      "inputs": [[332, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar17", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul17", 
      "inputs": [[326, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape106", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected35", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 17, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_add_signal", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[340, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape107", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[341, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot53", 
      "inputs": [[339, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[338, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot54", 
      "inputs": [[331, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape109", 
      "attrs": {"shape": "(-1, 100)"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "similarity_score", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "50"
      }, 
      "inputs": [[4, 19, 0], [5, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "softmaxactivation19", 
      "inputs": [[347, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape114", 
      "attrs": {"shape": "(-1, 1, 50)"}, 
      "inputs": [[348, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape110", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected36", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[22, 18, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "DKVMN->value_head_erase_signal", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape111", 
      "attrs": {"shape": "(-1, 1, 100)"}, 
      "inputs": [[352, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "batch_dot55", 
      "inputs": [[350, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar18", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul18", 
      "inputs": [[344, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape112", 
      "attrs": {"shape": "(-1, 50, 1)"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
